nrfconnect/sdk-nrf/applications/nrf5340_audio/src/bluetooth/bt_stream/unicast/unicast_client.c
	ret = channel_index_get(conn, &headset_idx);
	if (ret) {
		LOG_WRN("No configured streams found");
		return ret;
	}

	if (dir == BT_AUDIO_DIR_SINK) {
		if (headsets[headset_idx].sink_stream.codec_cfg == NULL) {
			LOG_ERR("No codec found for the stream");

			return -ENXIO;
		}

		if (sampling_rate_hz != NULL) {
			ret = le_audio_freq_hz_get(headsets[headset_idx].sink_stream.codec_cfg,
						   sampling_rate_hz);
			if (ret) {
				LOG_ERR("Invalid sampling frequency: %d", ret);
				return -ENXIO;
			}
		}

		if (bitrate != NULL) {
			ret = le_audio_bitrate_get(headsets[headset_idx].sink_stream.codec_cfg,
						   bitrate);
			if (ret) {
				LOG_ERR("Unable to calculate bitrate: %d", ret);
				return -ENXIO;
			}
		}
	} else if (dir == BT_AUDIO_DIR_SOURCE) {
		if (headsets[headset_idx].source_stream.codec_cfg == NULL) {
			LOG_ERR("No codec found for the stream");
			return -ENXIO;
		}

		if (sampling_rate_hz != NULL) {
			ret = le_audio_freq_hz_get(headsets[headset_idx].source_stream.codec_cfg,
						   sampling_rate_hz);
			if (ret) {
				LOG_ERR("Invalid sampling frequency: %d", ret);
				return -ENXIO;
			}
		}

		if (bitrate != NULL) {
			ret = le_audio_bitrate_get(headsets[headset_idx].source_stream.codec_cfg,
						   bitrate);
			if (ret) {
				LOG_ERR("Unable to calculate bitrate: %d", ret);
				return -ENXIO;
			}
		}
	}

	return 0;
}

void unicast_client_conn_disconnected(struct bt_conn *conn)
{
	int ret;
	uint8_t channel_index;

	ret = channel_index_get(conn, &channel_index);
	if (ret) {
		LOG_WRN("Unknown connection disconnected");
	} else {
		disconnected_headset_cleanup(channel_index);
	}
}

int unicast_client_discover(struct bt_conn *conn, enum unicast_discover_dir dir)
{
	int ret;
	uint8_t index;

	ret = channel_index_vacant_get(conn, &index);
	if (ret) {
		return ret;
	}

	headsets[index].headset_conn = conn;

	if (dir & BT_AUDIO_DIR_SOURCE) {
		headsets[index].waiting_for_source_disc = true;
	}

	if (dir & BT_AUDIO_DIR_SINK) {
		headsets[index].waiting_for_sink_disc = true;
	}

	if (dir == UNICAST_SERVER_BIDIR) {
		/* If we need to discover both source and sink, do sink first */
		ret = bt_bap_unicast_client_discover(conn, BT_AUDIO_DIR_SINK);
		return ret;
	}

	ret = bt_bap_unicast_client_discover(conn, dir);
	return ret;
}

int unicast_client_start(enum bt_audio_dir dir)
{
	int ret;
	bool any_errors = false;

	for (int i = 0; i < ARRAY_SIZE(headsets); i++) {
		if (dir == BT_AUDIO_DIR_SINK &&
		    le_audio_ep_state_check(headsets[i].sink_stream.ep,
					    BT_BAP_EP_STATE_QOS_CONFIGURED)) {
			/* Start all streams in the configured state */
			ret = bt_bap_stream_enable(&headsets[i].sink_stream,
						   lc3_preset_sink.codec_cfg.meta,
						   lc3_preset_sink.codec_cfg.meta_len);

			if (ret) {
				LOG_WRN("Failed to enable stream %d: %d", i, ret);
				any_errors = true;
			}

		} else if (dir == BT_AUDIO_DIR_SOURCE &&
			   le_audio_ep_state_check(headsets[i].source_stream.ep,
						   BT_BAP_EP_STATE_QOS_CONFIGURED)) {
			/* Start all streams in the configured state */
			ret = bt_bap_stream_enable(&headsets[i].source_stream,
						   lc3_preset_source.codec_cfg.meta,
						   lc3_preset_source.codec_cfg.meta_len);

			if (ret) {
				LOG_WRN("Failed to enable stream %d: %d", i, ret);
				any_errors = true;
			}
		}
	}

	if (any_errors) {
		return -EIO;
	}

	playing_state = true;

	return 0;
}

int unicast_client_stop(enum bt_audio_dir dir)
{
	int ret;
	bool any_errors = false;

	le_audio_event_publish(LE_AUDIO_EVT_NOT_STREAMING, NULL, 0);

	for (int i = 0; i < ARRAY_SIZE(headsets); i++) {
		if (dir == BT_AUDIO_DIR_SINK &&
		    le_audio_ep_state_check(headsets[i].sink_stream.ep,
					    BT_BAP_EP_STATE_STREAMING)) {
			/* Stop all streams currently in a streaming state */
			ret = bt_bap_stream_disable(&headsets[i].sink_stream);

			if (ret) {
				LOG_WRN("Failed to disable stream %d: %d", i, ret);
				any_errors = true;
			}

		} else if (dir == BT_AUDIO_DIR_SOURCE &&
			   le_audio_ep_state_check(headsets[i].source_stream.ep,
						   BT_BAP_EP_STATE_STREAMING)) {
			/* Stop all streams currently in a streaming state */
			ret = bt_bap_stream_disable(&headsets[i].source_stream);

			if (ret) {
				LOG_WRN("Failed to disable stream %d: %d", i, ret);
				any_errors = true;
			}
		}
	}

	if (any_errors) {
		return -EIO;
	}

	playing_state = false;

	return 0;
}

int unicast_client_send(struct le_audio_encoded_audio enc_audio)
{
#if (CONFIG_BT_AUDIO_TX)
	int ret;
	struct bt_bap_stream *bap_tx_streams[CONFIG_BT_BAP_UNICAST_CLIENT_ASE_SNK_COUNT];
	uint8_t audio_mapping_mask[CONFIG_BT_BAP_UNICAST_CLIENT_ASE_SNK_COUNT] = {UINT8_MAX};

	for (int i = 0; i < CONFIG_BT_BAP_UNICAST_CLIENT_ASE_SNK_COUNT; i++) {
		bap_tx_streams[i] = &headsets[i].sink_stream;
		if (headsets[i].location == BT_AUDIO_LOCATION_FRONT_RIGHT) {
			audio_mapping_mask[i] = AUDIO_CH_R;
		} else {
			/* Both mono and left devices will receive left channel */
			audio_mapping_mask[i] = AUDIO_CH_L;
		}
	}

	ret = bt_le_audio_tx_send(bap_tx_streams, audio_mapping_mask, enc_audio,
				  CONFIG_BT_BAP_UNICAST_CLIENT_ASE_SNK_COUNT);
	if (ret) {
		return ret;
	}
#endif /* (CONFIG_BT_AUDIO_TX) */

	return 0;
}

int unicast_client_disable(void)
{
	return -ENOTSUP;
}

int unicast_client_enable(le_audio_receive_cb recv_cb)
{
	int ret;
	static bool initialized;
	int headset_iterator = 0;
	int stream_iterator = 0;
	struct bt_bap_unicast_group_stream_pair_param pair_params[ARRAY_SIZE(headsets)];
	/* 2 streams (one sink and one source stream) for each headset */
	struct bt_bap_unicast_group_stream_param group_stream_params[(ARRAY_SIZE(headsets) * 2)];
	struct bt_bap_unicast_group_param group_param;

	if (initialized) {
		LOG_WRN("Already initialized");
		return -EALREADY;
	}

	if (recv_cb == NULL) {
		LOG_ERR("Receive callback is NULL");
		return -EINVAL;
	}

	receive_cb = recv_cb;

	LOG_DBG("Start workers");

	for (int i = 0; i < ARRAY_SIZE(headsets); i++) {
		headsets[i].source_stream.ops = &stream_ops;
		headsets[i].sink_stream.ops = &stream_ops;
		k_work_init_delayable(&headsets[i].stream_start_sink_work, work_stream_start);
		k_work_init_delayable(&headsets[i].stream_start_source_work, work_stream_start);
	}

	ret = bt_bap_unicast_client_register_cb(&unicast_client_cbs);
	if (ret != 0) {
		LOG_ERR("Failed to register client callbacks: %d", ret);
		return ret;
	}

	if (IS_ENABLED(CONFIG_BT_AUDIO_TX)) {
		ret = bt_le_audio_tx_init();
		if (ret) {
			return ret;
		}
	}

	for (int i = 0; i < ARRAY_SIZE(group_stream_params); i++) {
		/* Every other stream should be sink or source */
		if ((i % 2) == 0) {
			group_stream_params[i].qos = &lc3_preset_max.qos;
			group_stream_params[i].stream = &headsets[headset_iterator].sink_stream;
		} else {
			group_stream_params[i].qos = &lc3_preset_max.qos;
			group_stream_params[i].stream = &headsets[headset_iterator].source_stream;
			headset_iterator++;
		}
	}

	for (int i = 0; i < ARRAY_SIZE(pair_params); i++) {
		if (IS_ENABLED(CONFIG_BT_AUDIO_TX)) {
			pair_params[i].tx_param = &group_stream_params[stream_iterator];
		} else {
			pair_params[i].tx_param = NULL;
		}
		stream_iterator++;

		if (IS_ENABLED(CONFIG_BT_AUDIO_RX)) {
			pair_params[i].rx_param = &group_stream_params[stream_iterator];
		} else {
			pair_params[i].rx_param = NULL;
		}

		stream_iterator++;
	}

	group_param.params = pair_params;
	group_param.params_count = ARRAY_SIZE(pair_params);

	if (IS_ENABLED(CONFIG_BT_AUDIO_PACKING_INTERLEAVED)) {
		group_param.packing = BT_ISO_PACKING_INTERLEAVED;
	} else {
		group_param.packing = BT_ISO_PACKING_SEQUENTIAL;
	}

	ret = bt_bap_unicast_group_create(&group_param, &unicast_group);
	if (ret) {
		LOG_ERR("Failed to create unicast group: %d", ret);
		return ret;
	}

	initialized = true;

	return 0;
}
